Autodesk.Revit.DB.ShapeImporter.IsServiceAvailable
Checks whether the data conversion service and Material Library are available.
Remarks:
ShapeImporter relies on optional data conversion functionality. This function checks whether it is available.
Returns:
True if the data conversion service and Material Library are available, false otherwise.
Since:
2017

Autodesk.Revit.DB.ShapeImporter.Convert(Autodesk.Revit.DB.Document,System.String)
Converts the geometry stored in the external format into a collection of Revit geometry objects.
document:
The Revit document where the resulting Revit geometry objects will be used. This document may need to be modified
to store dependent elements such as graphics styles and/or materials.
filename:
The full path to the input file.
Returns:
A collection of Revit geometry objects created from the incoming data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given filename does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Data conversion service is not available, or the Material Library is missing.
Since:
2017